Update README.md
Improve README with clearer environment, packages, and git clone instructions
